# temp : the list from front-end
id_orderList = [['身心障礙','身心障礙學生']
                      ,['低收入戶']
                      ,['中低收入戶']
                      ,['離島']
                      ,['原住民']
                      ,['僑生','僑外生就讀本校第一學期']
                      ,['國際生','外籍生']
                      ,['外交人員子女']
                      ,['醫學系公費生']]

# temp : get this from front-end
id_dict = {'身心障礙' :1
              ,'低收入戶' :2
              ,'中低收入戶' :3
              ,'離島' :4
              ,'原住民' :5
              ,'僑生' :6
              ,'國際生' :7
              ,'外交人員子女' :8
              ,'醫學系公費生' :9}
              
audit_list = ['身心障礙','中低收入戶','離島','原住民','低收入戶']
willing_InOutCam = {'校內宿舍'    :1
                              ,'不限'    :2
                              ,'校外BOT宿舍'    :3}

id_col_name = ['身分別1','身分別2','身分別3','特殊身份別']

last_order_habitation = ['台北市','新北市','基隆市']


# function 2
Ori_ColumnToBeDrop = ['系所代碼','系所名稱','年級','姓名','入學年度','永久地址郵遞區號'
                                         ,'身分別','身體狀況是否爬上鋪床','審查備注','審查人員','審查時間'
                                         ,'身份證/護照證號','居留證號','聯絡郵件1','聯絡郵件2','國內住家電話'
                                         ,'國外電話','手機','郵遞區號','通訊地址','聯絡人姓名','與聯絡人關係'
                                         ,'聯絡人電話','聯絡人手機','送出時間','現住床位','最後修改','操作人員']
Wait_Drop = ['身分別1', '身分別2', '身分別3', 'BOT志願1', 'BOT志願2', 'BOT志願3', '特殊身份別','審查狀態']
AlgorithmNeedDrop = ['身分別1', '身分別2', '身分別3','BOT志願1', 'BOT志願2', 'BOT志願3', '戶籍地', '特殊身份別','是否需要安排身障房間','審查狀態']




# function 3
Ori_DfDropForICampus =['系所代碼',  '年級',  '性別', '入學年度', '身分別', '身分別1', '身分別2'
                                       ,'身分別3', 'BOT志願1', 'BOT志願2','BOT志願3','永久地址郵遞區號', '永久地址'
                                       , '特殊身份別', '身體狀況是否爬上鋪床','審查狀態', '審查備注', '審查人員', '審查時間'
                                       , '身份證/護照證號', '居留證號','聯絡郵件1', '聯絡郵件2', '國內住家電話', '國外電話'
                                       , '手機', '郵遞區號', '通訊地址', '聯絡人姓名','與聯絡人關係', '聯絡人電話', '聯絡人手機'
                                       , '送出時間', '現住床位', '最後修改', '操作人員']
Qua_Drop = ['區域志願1', '區域志願2', '區域志願3','校內外意願']

CampusWait_Drop_AsQua =  ['戶籍地','是否需要安排身障房間']



StudentList_Drop_ForMapBot = ['系所代碼','性別', '年級','入學年度', '身分別', '身分別1', '身分別2','戶籍地','是否需要安排身障房間'
                                                ,'身分別3','BOT志願1', 'BOT志願2','BOT志願3', '戶籍地', '永久地址郵遞區號'
                                                , '永久地址', '特殊身份別', '身體狀況是否爬上鋪床','是否需要安排身障房間'
                                                , '審查狀態', '審查備注', '審查人員', '審查時間', '身份證/護照證號', '居留證號'
                                                ,'聯絡郵件1', '聯絡郵件2', '國內住家電話', '國外電話', '手機', '郵遞區號', '通訊地址', '聯絡人姓名'
                                                ,'與聯絡人關係', '聯絡人電話', '聯絡人手機', '送出時間', '現住床位', '最後修改', '操作人員']
Bot_Drop_ForOutput =  ['校內外意願', '區域志願1', '區域志願2', '區域志願3']

 


